CARDINALS = {
    '0': 'НОЛЬ*',
    '1': 'ОДИН*',
    '2': 'ДВА*',
    '3': 'ТРИ*',
    '4': 'ЧЕТЫРЕ*',
    '5': 'ПЯТЬ*',
    '6': 'ШЕСТЬ*',
    '7': 'СЕМЬ*',
    '8': 'ВОСЕМЬ*',
    '9': 'ДЕВЯТЬ*',
    '10': 'ДЕСЯТЬ*',
    '11': 'ОДИННАДЦАТЬ*',
    '12': 'ДВЕНАДЦАТЬ*',
    '13': 'ТРИНАДЦАТЬ*',
    '14': 'ЧЕТЫРНАДЦАТЬ*',
    '15': 'ПЯТНАДЦАТЬ*',
    '16': 'ШЕСТНАДЦАТЬ*',
    '17': 'СЕМНАДЦАТЬ*',
    '18': 'ВОСЕМНАДЦАТЬ*',
    '19': 'ДЕВЯТНАДЦАТЬ*',
    '20': 'ДВАДЦАТЬ*',
    '30': 'ТРИДЦАТЬ*',
    '40': 'СОРОК*',
    '50': 'ПЯТЬДЕСЯТ*',
    '60': 'ШЕСТЬДЕСЯТ*',
    '70': 'СЕМЬДЕСЯТ*',
    '80': 'ВОСЕМЬДЕСЯТ*',
    '90': 'ДЕВЯНОСТО*',
    '100': 'СТО*',
    '1000': 'ТЫСЯЧА*',
    '1000000': 'МИЛЛИОН*',
    '1000000000': 'МИЛЛИАРД*',
}

ORDINALS = {
    '0': 'НУЛЕВ*',
    '1': 'ПЕРВ*',
    '2': 'ВТОР*',
    '3': 'ТРЕТ*',
    '4': 'ЧЕТВЁРТ*',
    '5': 'ПЯТ*',
    '6': 'ШЕСТ*',
    '7': 'СЕДЬМ*',
    '8': 'ВОСЬМ*',
    '9': 'ДЕВЯТ*',
    '10': 'ДЕСЯТ*',
    '11': 'ОДИННАДЦАТ*',
    '12': 'ДВЕНАДЦАТ*',
    '13': 'ТРИНАДЦАТ*',
    '14': 'ЧЕТЫРНАДЦАТ*',
    '15': 'ПЯТНАДЦАТ*',
    '16': 'ШЕСТНАДЦАТ*',
    '17': 'СЕМНАДЦАТ*',
    '18': 'ВОСЕМНАДЦАТ*',
    '19': 'ДЕВЯТНАДЦАТ*',
    '20': 'ДВАДЦАТ*',
    '30': 'ТРИДЦАТ*',
    '40': 'СОРОКОВ*',
    '50': 'ПЯТЬДЕСЯТ*',
    '60': 'ШЕСТЬДЕСЯТ*',
    '70': 'СЕМЬДЕСЯТ*',
    '80': 'ВОСЕМЬДЕСЯТ*',
    '90': 'ДЕВЯНОСТ*',
    '100': 'СОТ*',
    '1000': 'ТЫСЯЧН*',
    '1000000': 'МИЛЛИОНН*',
    '1000000000': 'МИЛЛИАРДН*',
}


class Labels:
    def __init__(self):
        self.labels = labels
        self.labels_map = dict([(labels[i], i) for i in range(len(labels))])

    def getch(self, c):
        if c == 'Ё':
            return 'Е'
        if c.isdigit():
            return ' ' + CARDINALS[c] + ' '
        if c == '*':
            return ' '
        if c in self.labels_map:
            return c
        return ' '
